### groupby() 와 agg()

In [18]:
# DataFrame.groupby(기준항목).agg(사용하고자 하는 function들)

In [3]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd

In [5]:
exam = pd.read_csv('data/exam.csv')
exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [7]:
exam.groupby("nclass")[['math','english','science']].mean()

         math  english  science
nclass
1       46.25    94.75    61.50
2       61.25    84.25    58.25
3       45.00    86.50    39.25
4       56.75    84.75    55.00
5       78.00    74.25    83.25

In [40]:
exam.groupby('nclass').agg(mean_math   = ('math', 'mean'),         
                         sum_math    = ('math', 'sum'),          
                         median_math = ('math', 'median'),        
                         n = ('nclass', 'count'))

        mean_math  sum_math  median_math  n
nclass
1           46.25       185         47.5  4
2           61.25       245         65.0  4
3           45.00       180         47.5  4
4           56.75       227         53.0  4
5           78.00       312         79.0  4

In [42]:
exam.query("nclass==1")

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [44]:
exam.query("math>50")

    id  nclass  math  english  science
1    2       1    60       97       60
6    7       2    80       90       45
7    8       2    90       78       25
10  11       3    65       65       65
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [50]:
exam.query("nclass==1 & math>=50")

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60

In [52]:
exam.query("nclass == 1 | nclass==3")

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32

In [54]:
exam.query("nclass==1")['math'].mean()

46.25

### 데이터 합치기 _ merge(), concat()

In [20]:
# 중간고사 데이터 만들기
test1 = pd.DataFrame({'id'      : [1, 2, 3, 4, 5, 7],
                      'midterm' : [60, 80, 70, 90, 85, 20]})

# 기말고사 데이터 만들기
test2 = pd.DataFrame({'id'    : [1, 2, 3, 4, 5, 6],
                      'final' : [70, 83, 65, 95, 80, 10]})

In [22]:
test1

   id  midterm
0   1       60
1   2       80
2   3       70
3   4       90
4   5       85
5   7       20

In [28]:
total = pd.merge(test1,test2,on="id",how="left") ##  how='outer'로 하면, 양쪽 모든 데이터
total

   id  midterm  final
0   1       60   70.0
1   2       80   83.0
2   3       70   65.0
3   4       90   95.0
4   5       85   80.0
5   7       20    NaN

In [30]:
group_a = pd.DataFrame({'id'   : [1, 2, 3, 4, 5],
                        'test' : [60, 80, 70, 90, 85]})

group_b = pd.DataFrame({'id'   : [6, 7, 8, 9, 10],
                        'test' : [70, 83, 65, 95, 80]})

In [32]:
group_all = pd.concat([group_a,group_b],ignore_index=True)
group_all

   id  test
0   1    60
1   2    80
2   3    70
3   4    90
4   5    85
5   6    70
6   7    83
7   8    65
8   9    95
9  10    80

### loc 와  iloc

In [37]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Score': [85, 90, 95]
}
df = pd.DataFrame(data, index=['A', 'B', 'C'])
df

      Name  Age  Score
A    Alice   25     85
B      Bob   30     90
C  Charlie   35     95

In [41]:
df.loc[['A']]

    Name  Age  Score
A  Alice   25     85

In [43]:
df.loc['A':'B','Name']

A    Alice
B      Bob
Name: Name, dtype: object

In [53]:
df.loc[:'B','Name']

A    Alice
B      Bob
Name: Name, dtype: object

In [59]:
df.loc[df['Age'] > 28]

      Name  Age  Score
B      Bob   30     90
C  Charlie   35     95

In [61]:
df.iloc[0:2]

    Name  Age  Score
A  Alice   25     85
B    Bob   30     90